In [253]:
# 23-07-25, Wednesday;

# Pandas: Pandas is an open-source software library for the Python programming language, designed for data manipulation and analysis. It provides powerful data structures and tools for working with structured data, particularly tabular data like spreadsheets or SQL tables, and time series data.
# It is collection of Arrays (of NumPy).
# Pandas: Panel Data or Python for Data Analysis.

import pandas as pd

df = pd.read_csv(r"C:\Data Analytics Json\Python\Code\mckinsey.csv")

In [254]:
df

          country  year  population continent  life_exp     gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801  779.445314
1     Afghanistan  1957     9240934      Asia    30.332  820.853030
2     Afghanistan  1962    10267083      Asia    31.997  853.100710
3     Afghanistan  1967    11537966      Asia    34.020  836.197138
4     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298

[1704 rows x 6 columns]

In [255]:
df.head() #pass num for limit of data like in SQL.

       country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106

In [256]:
df.tail() #last data.

       country  year  population continent  life_exp     gdp_cap
1699  Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700  Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701  Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702  Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703  Zimbabwe  2007    12311143    Africa    43.487  469.709298

In [257]:
df.info() # Print a concise summary of a DataFrame.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   country     1704 non-null   object
 1   year        1704 non-null   int64
 2   population  1704 non-null   int64
 3   continent   1704 non-null   object
 4   life_exp    1704 non-null   float64
 5   gdp_cap     1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [258]:
df.describe() # Generate descriptive statistics.

             year    population     life_exp        gdp_cap
count  1704.00000  1.704000e+03  1704.000000    1704.000000
mean   1979.50000  2.960121e+07    59.474439    7215.327081
std      17.26533  1.061579e+08    12.917107    9857.454543
min    1952.00000  6.001100e+04    23.599000     241.165876
25%    1965.75000  2.793664e+06    48.198000    1202.060309
50%    1979.50000  7.023596e+06    60.712500    3531.846988
75%    1993.25000  1.958522e+07    70.845500    9325.462346
max    2007.00000  1.318683e+09    82.603000  113523.132900

In [259]:
df.describe(include = "object") # Generate descriptive statistics for object columns.

            country continent
count          1704      1704
unique          142         5
top     Afghanistan    Africa
freq             12       624

In [260]:
df.shape

(1704, 6)

In [261]:
df.size

10224

In [262]:
len(df)

1704

In [263]:
# creating dataframe.
# List format: Row-wise

df1 =pd.DataFrame([
    ["India", 2025, 142847564, "Asia", 67, 2480],
    ["USA", 2025, 13028475, "North America", 77, 90000],
    ["UAE", 2025, 4000000, "Asia", 75, 73000]
],
columns = ["Country", "Year", "Population", "Continent", "Life Expectancy", "GDP per Capita"])

In [264]:
df1

  Country  Year  Population      Continent  Life Expectancy  GDP per Capita
0   India  2025   142847564           Asia               67            2480
1     USA  2025    13028475  North America               77           90000
2     UAE  2025     4000000           Asia               75           73000

In [265]:
# creating dataframe.
# Dictionary format: Col-wise

df2 = pd.DataFrame({
    "Country" : ["Monaco", "Germany", "Australia"],
    "Year" : [2025, 2025, 2025],
    "Population" : [39000, 7238000, 4532687],
    "Continent" : ["Europe", "Europe", "Australia"],
    "Life Expectancy" : [80, 83, 81],
    "GDP per Capita" : [70000, 80000, 60000]
})

In [266]:
df2

     Country  Year  Population  Continent  Life Expectancy  GDP per Capita
0     Monaco  2025       39000     Europe               80           70000
1    Germany  2025     7238000     Europe               83           80000
2  Australia  2025     4532687  Australia               81           60000

In [267]:
df.head()

       country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106

In [268]:
df["year"] # col names are indices.

0       1952
1       1957
2       1962
3       1967
4       1972
        ...
1699    1987
1700    1992
1701    1997
1702    2002
1703    2007
Name: year, Length: 1704, dtype: int64

In [269]:
type(df["year"]) # series means 1D array.

pandas.core.series.Series

In [270]:
# slicing:
df[["year", "life_exp"]].head() #like SELECT in SQL.

   year  life_exp
0  1952    28.801
1  1957    30.332
2  1962    31.997
3  1967    34.020
4  1972    36.088

In [271]:
df[["country", "year", "population", "gdp_cap", "life_exp", "continent"]].head() #changed sequence.

       country  year  population     gdp_cap  life_exp continent
0  Afghanistan  1952     8425333  779.445314    28.801      Asia
1  Afghanistan  1957     9240934  820.853030    30.332      Asia
2  Afghanistan  1962    10267083  853.100710    31.997      Asia
3  Afghanistan  1967    11537966  836.197138    34.020      Asia
4  Afghanistan  1972    13079460  739.981106    36.088      Asia

In [272]:
df.life_exp.head() #index as method.

0    28.801
1    30.332
2    31.997
3    34.020
4    36.088
Name: life_exp, dtype: float64

In [273]:
df["continent"].unique()

array(['Asia', 'Europe', 'Africa', 'Americas', 'Oceania'], dtype=object)

In [274]:
df["continent"].nunique()

5

In [275]:
df["continent"].value_counts()

continent
Africa      624
Asia        396
Europe      360
Americas    300
Oceania      24
Name: count, dtype: int64

In [276]:
df["country"].unique()

array(['Afghanistan', 'Albania', 'Algeria', 'Angola', 'Argentina',
       'Australia', 'Austria', 'Bahrain', 'Bangladesh', 'Belgium',
       'Benin', 'Bolivia', 'Bosnia and Herzegovina', 'Botswana', 'Brazil',
       'Bulgaria', 'Burkina Faso', 'Burundi', 'Cambodia', 'Cameroon',
       'Canada', 'Central African Republic', 'Chad', 'Chile', 'China',
       'Colombia', 'Comoros', 'Congo, Dem. Rep.', 'Congo, Rep.',
       'Costa Rica', "Cote d'Ivoire", 'Croatia', 'Cuba', 'Czech Republic',
       'Denmark', 'Djibouti', 'Dominican Republic', 'Ecuador', 'Egypt',
       'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Ethiopia',
       'Finland', 'France', 'Gabon', 'Gambia', 'Germany', 'Ghana',
       'Greece', 'Guatemala', 'Guinea', 'Guinea-Bissau', 'Haiti',
       'Honduras', 'Hong Kong, China', 'Hungary', 'Iceland', 'India',
       'Indonesia', 'Iran', 'Iraq', 'Ireland', 'Israel', 'Italy',
       'Jamaica', 'Japan', 'Jordan', 'Kenya', 'Korea, Dem. Rep.',
       'Korea, Rep.', 'Kuwait', 'Lebanon', 'Lesotho', 'Liberia', 'Libya',
       'Madagascar', 'Malawi', 'Malaysia', 'Mali', 'Mauritania',
       'Mauritius', 'Mexico', 'Mongolia', 'Montenegro', 'Morocco',
       'Mozambique', 'Myanmar', 'Namibia', 'Nepal', 'Netherlands',
       'New Zealand', 'Nicaragua', 'Niger', 'Nigeria', 'Norway', 'Oman',
       'Pakistan', 'Panama', 'Paraguay', 'Peru', 'Philippines', 'Poland',
       'Portugal', 'Puerto Rico', 'Reunion', 'Romania', 'Rwanda',
       'Sao Tome and Principe', 'Saudi Arabia', 'Senegal', 'Serbia',
       'Sierra Leone', 'Singapore', 'Slovak Republic', 'Slovenia',
       'Somalia', 'South Africa', 'Spain', 'Sri Lanka', 'Sudan',
       'Swaziland', 'Sweden', 'Switzerland', 'Syria', 'Taiwan',
       'Tanzania', 'Thailand', 'Togo', 'Trinidad and Tobago', 'Tunisia',
       'Turkey', 'Uganda', 'United Kingdom', 'United States', 'Uruguay',
       'Venezuela', 'Vietnam', 'West Bank and Gaza', 'Yemen, Rep.',
       'Zambia', 'Zimbabwe'], dtype=object)

In [277]:
df["country"].nunique()

142

In [278]:
# 24-07-25, Thursday;

df.head()

       country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106

In [279]:
df.rename({"country" : "Country"}, axis = 1) #original df remains unchanged. Returns copy of the DataFrame.

          Country  year  population continent  life_exp     gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801  779.445314
1     Afghanistan  1957     9240934      Asia    30.332  820.853030
2     Afghanistan  1962    10267083      Asia    31.997  853.100710
3     Afghanistan  1967    11537966      Asia    34.020  836.197138
4     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298

[1704 rows x 6 columns]

In [280]:
df.rename({"country" : "Country"}, axis = 1, inplace = True) # To modify DF.

In [281]:
df.head()

       Country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106

In [282]:
# df.drop(["gdp_cap"], axis = 1, inplace = True) # Drop specified labels from rows or columns.

In [283]:
df.head()

       Country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106

In [284]:
# df.drop(["continent", "life_exp"], axis = 1, inplace = True) # in "r" mode, file won't change, only DataFrame. It will in "w" mode.

In [285]:
df["population"] = (df["population"]/1000000).round() #converting population to Mil and round.

In [286]:
df.head()

       Country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952         8.0      Asia    28.801  779.445314
1  Afghanistan  1957         9.0      Asia    30.332  820.853030
2  Afghanistan  1962        10.0      Asia    31.997  853.100710
3  Afghanistan  1967        12.0      Asia    34.020  836.197138
4  Afghanistan  1972        13.0      Asia    36.088  739.981106

In [287]:
df["add_2_years"] = df["year"] + 2 #adding new column.

In [288]:
df.head()

       Country  year  population continent  life_exp     gdp_cap  add_2_years
0  Afghanistan  1952         8.0      Asia    28.801  779.445314         1954
1  Afghanistan  1957         9.0      Asia    30.332  820.853030         1959
2  Afghanistan  1962        10.0      Asia    31.997  853.100710         1964
3  Afghanistan  1967        12.0      Asia    34.020  836.197138         1969
4  Afghanistan  1972        13.0      Asia    36.088  739.981106         1974

In [289]:
df.shape

(1704, 7)

In [290]:
df.index = [i for i in range(10000, 11704)]

In [291]:
df.head()

,Country,year,population,continent,life_exp,gdp_cap,add_2_years
10000,Afghanistan,1952,8.0,Asia,28.801,779.445314,1954
10001,Afghanistan,1957,9.0,Asia,30.332,820.853030,1959
10002,Afghanistan,1962,10.0,Asia,31.997,853.100710,1964
10003,Afghanistan,1967,12.0,Asia,34.020,836.197138,1969
10004,Afghanistan,1972,13.0,Asia,36.088,739.981106,1974

In [292]:
# df.reset_index()

In [293]:
# df = df.reset_index().rename(columns={"index": "index"})
df.reset_index(drop = True, inplace = True) #removes changes.

In [294]:
df.head()

       Country  year  population continent  life_exp     gdp_cap  add_2_years
0  Afghanistan  1952         8.0      Asia    28.801  779.445314         1954
1  Afghanistan  1957         9.0      Asia    30.332  820.853030         1959
2  Afghanistan  1962        10.0      Asia    31.997  853.100710         1964
3  Afghanistan  1967        12.0      Asia    34.020  836.197138         1969
4  Afghanistan  1972        13.0      Asia    36.088  739.981106         1974

In [295]:
# df.sort_values(by = ["year", "life_exp"], ascending = [True, False]).head(10)

In [296]:
df.iloc[21 : 26 , 0 : 4] #iloc, i is for implicit. for implicit index.

    Country  year  population continent
21  Albania  1997         3.0    Europe
22  Albania  2002         4.0    Europe
23  Albania  2007         4.0    Europe
24  Algeria  1952         9.0    Africa
25  Algeria  1957        10.0    Africa

In [297]:
df.loc[21 : 26 , "Country" : "continent"] #loc, for explicit index. end is included.

    Country  year  population continent
21  Albania  1997         3.0    Europe
22  Albania  2002         4.0    Europe
23  Albania  2007         4.0    Europe
24  Algeria  1952         9.0    Africa
25  Algeria  1957        10.0    Africa
26  Algeria  1962        11.0    Africa

In [298]:
df.loc[[21, 26] , :]

    Country  year  population continent  life_exp      gdp_cap  add_2_years
21  Albania  1997         3.0    Europe    72.950  3193.054604         1999
26  Algeria  1962        11.0    Africa    48.303  2550.816880         1964

In [299]:
df.loc[[21, 26] , ["Country", "year", "life_exp", "gdp_cap"]]

    Country  year  life_exp      gdp_cap
21  Albania  1997    72.950  3193.054604
26  Algeria  1962    48.303  2550.816880

In [300]:
df.tail()

       Country  year  population continent  life_exp     gdp_cap  add_2_years
1699  Zimbabwe  1987         9.0    Africa    62.351  706.157306         1989
1700  Zimbabwe  1992        11.0    Africa    60.377  693.420786         1994
1701  Zimbabwe  1997        11.0    Africa    46.809  792.449960         1999
1702  Zimbabwe  2002        12.0    Africa    39.989  672.038623         2004
1703  Zimbabwe  2007        12.0    Africa    43.487  469.709298         2009

In [301]:
df.loc[1704] = ["Wakanda", 2007, 12, "Africa", 83.487, 756765.7, 2009]
df.tail()

,Country,year,population,continent,life_exp,gdp_cap,add_2_years
1700,Zimbabwe,1992,11.0,Africa,60.377,693.420786,1994
1701,Zimbabwe,1997,11.0,Africa,46.809,792.449960,1999
1702,Zimbabwe,2002,12.0,Africa,39.989,672.038623,2004
1703,Zimbabwe,2007,12.0,Africa,43.487,469.709298,2009
1704,Wakanda,2007,12.0,Africa,83.487,756765.700000,2009

In [302]:
df.loc[len(df)] = ["Wakanda", 2009, 12, "Africa", 85.487, 757865.7, 2011]
df.tail()

,Country,year,population,continent,life_exp,gdp_cap,add_2_years
1701,Zimbabwe,1997,11.0,Africa,46.809,792.449960,1999
1702,Zimbabwe,2002,12.0,Africa,39.989,672.038623,2004
1703,Zimbabwe,2007,12.0,Africa,43.487,469.709298,2009
1704,Wakanda,2007,12.0,Africa,83.487,756765.700000,2009
1705,Wakanda,2009,12.0,Africa,85.487,757865.700000,2011

In [303]:
# df.loc[1706, "Country"] = "Sokovia"
df.tail()

,Country,year,population,continent,life_exp,gdp_cap,add_2_years
1701,Zimbabwe,1997,11.0,Africa,46.809,792.449960,1999
1702,Zimbabwe,2002,12.0,Africa,39.989,672.038623,2004
1703,Zimbabwe,2007,12.0,Africa,43.487,469.709298,2009
1704,Wakanda,2007,12.0,Africa,83.487,756765.700000,2009
1705,Wakanda,2009,12.0,Africa,85.487,757865.700000,2011

In [304]:
df.duplicated().sum() #count of duplicates.

np.int64(0)

In [305]:
df.drop_duplicates(inplace = True)

In [306]:
df.tail()

,Country,year,population,continent,life_exp,gdp_cap,add_2_years
1701,Zimbabwe,1997,11.0,Africa,46.809,792.449960,1999
1702,Zimbabwe,2002,12.0,Africa,39.989,672.038623,2004
1703,Zimbabwe,2007,12.0,Africa,43.487,469.709298,2009
1704,Wakanda,2007,12.0,Africa,83.487,756765.700000,2009
1705,Wakanda,2009,12.0,Africa,85.487,757865.700000,2011

In [307]:
df[(df["Country"] == "India") & (df["life_exp"] > 50)]

    Country  year  population continent  life_exp      gdp_cap  add_2_years
700   India  1972       567.0      Asia    50.651   724.032527         1974
701   India  1977       634.0      Asia    54.208   813.337323         1979
702   India  1982       708.0      Asia    56.596   855.723538         1984
703   India  1987       788.0      Asia    58.553   976.512676         1989
704   India  1992       872.0      Asia    60.223  1164.406809         1994
705   India  1997       959.0      Asia    61.765  1458.817442         1999
706   India  2002      1034.0      Asia    62.879  1746.769454         2004
707   India  2007      1110.0      Asia    64.698  2452.210407         2009

In [308]:
# Performing JOIN.
users = pd.DataFrame({
    "user_id" : [1, 2, 3, 4, 5],
    "username" : ["a", "b", "c", "d", "e"]
})
users

   user_id username
0        1        a
1        2        b
2        3        c
3        4        d
4        5        e

In [309]:
messages = pd.DataFrame({
    "user_id" : [1, 2, 3, 4, 4],
    "msgs" : ["Valar", "Morghulis", "Valar", "Dohaeris", "Dracarys"]
})
messages

   user_id       msgs
0        1      Valar
1        2  Morghulis
2        3      Valar
3        4   Dohaeris
4        4   Dracarys

In [313]:
users.merge(messages, how = "inner", left_on = "user_id", right_on = "user_id") #inner join

   user_id username       msgs
0        1        a      Valar
1        2        b  Morghulis
2        3        c      Valar
3        4        d   Dohaeris
4        4        d   Dracarys

In [314]:
left_joint_table = users.merge(messages, how = "left") #left join
left_joint_table

   user_id username       msgs
0        1        a      Valar
1        2        b  Morghulis
2        3        c      Valar
3        4        d   Dohaeris
4        4        d   Dracarys
5        5        e        NaN

In [312]:
users.merge(messages, how = "outer") #outer join

   user_id username       msgs
0        1        a      Valar
1        2        b  Morghulis
2        3        c      Valar
3        4        d   Dohaeris
4        4        d   Dracarys
5        5        e        NaN

In [315]:
# Union
pd.concat([users, messages])

   user_id username       msgs
0        1        a        NaN
1        2        b        NaN
2        3        c        NaN
3        4        d        NaN
4        5        e        NaN
0        1      NaN      Valar
1        2      NaN  Morghulis
2        3      NaN      Valar
3        4      NaN   Dohaeris
4        4      NaN   Dracarys

In [316]:
pd.concat([users, messages], axis = 1)

   user_id username  user_id       msgs
0        1        a        1      Valar
1        2        b        2  Morghulis
2        3        c        3      Valar
3        4        d        4   Dohaeris
4        5        e        4   Dracarys